Examinator/src/InformationRegisters/ФотографииПользователейСУО/ФотографииПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФотографииПользователейСУО</name>
  <resources>
    <name>ЕстьАватар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Аватар</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ФотографииПользователейСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура СохранитьФотографиюПользователя(Знач Пользователь, АдресХраненияФайлаФотографии = "", АдресХраненияФайлаАватара = "", НеОбновлятьДанныеВебКабинета = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ФотографииПользователейСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда		
		НоваяЗапись = НаборЗаписей.Добавить();		
	Иначе		
		НоваяЗапись = НаборЗаписей[0];		
	КонецЕсли;
	
	НоваяЗапись.Пользователь = Пользователь;
	
	Если ЗначениеЗаполнено(АдресХраненияФайлаФотографии) Тогда
		НоваяЗапись.Фотография = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХраненияФайлаФотографии));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресХраненияФайлаАватара) Тогда
		НоваяЗапись.Аватар = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресХраненияФайлаАватара));
		НоваяЗапись.ЕстьАватар = Истина;
	Иначе
		НоваяЗапись.Аватар = Неопределено;
		НоваяЗапись.ЕстьАватар = Ложь;
	КонецЕсли;	
	
	Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	КонецЕсли;	
	
	НаборЗаписей.Записать();	
		
КонецПроцедуры

Процедура УдалитьФотографиюПользователя(Знач Пользователь, УдалитьФотографию = Ложь, УдалитьАватар = Ложь, НеОбновлятьДанныеВебКабинета = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ФотографииПользователейСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗапись = НаборЗаписей[0];
	
	НоваяЗапись.Пользователь = Пользователь;
	
	Если УдалитьФотографию Тогда
		НоваяЗапись.Фотография = Неопределено;
	КонецЕсли;
	
	Если УдалитьАватар Тогда
		НоваяЗапись.Аватар = Неопределено;
		НоваяЗапись.ЕстьАватар = Ложь;
	КонецЕсли;	
	
	Если НеОбновлятьДанныеВебКабинета <> Неопределено Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеВебКабинета", НеОбновлятьДанныеВебКабинета);
	КонецЕсли;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ЕстьАватар(Знач Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииПользователейСУО.ЕстьАватар
		|ИЗ
		|	РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|ГДЕ
		|	ФотографииПользователейСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.ЕстьАватар;
		
	КонецЕсли;
	
КонецФункции

// Веб-кабинет

Процедура ОбновитьДанныеВебКабинета(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Отбор) = Тип("СправочникСсылка.Пользователи") Тогда
		
		Пользователь = Отбор;
		
	Иначе
		
		Если Отбор.Найти("Пользователь") = Неопределено Тогда
			Пользователь = Неопределено;
		Иначе
			Пользователь = Отбор.Пользователь.Значение;
		КонецЕсли;
		
	КонецЕсли;	
		
	НаборЗаписей = РегистрыСведений.ФотографииПользователейСУО.СоздатьНаборЗаписей();	
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	КонецЕсли;
		
	НаборЗаписей.Прочитать();	
	
	Для каждого Запись Из НаборЗаписей Цикл
		
		ДвоичныеДанныеФотографии = Запись.Фотография.Получить();
		ДвоичныеДанныеАватара = Запись.Аватар.Получить();
		
		ПутьККаталогуПользователя = ВебКабинетСУ.ПутьККаталогуКартинок(ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу());	
		ПутьККаталогуПользователя = ПутьККаталогуПользователя + Строка(Запись.Пользователь.УникальныйИдентификатор());
		ПутьККаталогуПользователя = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуПользователя);
		
		СоздатьКаталог(ПутьККаталогуПользователя);
		
		// Фотография
		
		Если ДвоичныеДанныеФотографии <> Неопределено  Тогда
			ДвоичныеДанныеФотографии.Записать(ПутьККаталогуПользователя + ИмяФайлаФотографии(ДвоичныеДанныеФотографии));			
		КонецЕсли;
		
		// Аватар
		
		Если ДвоичныеДанныеАватара <> Неопределено  Тогда
			ДвоичныеДанныеАватара.Записать(ПутьККаталогуПользователя + ИмяФайлаАватара());			
		КонецЕсли;		
		
		// Обновление данных пользователя
		
		ВебКабинетСУО.ОбновитьДанныеПользователяВебКабинета(Запись.Пользователь)
		
	КонецЦикла;	
		
КонецПроцедуры

Функция ИмяФайлаФотографии(ДвоичныеДанныеКартинки) Экспорт
	
	Картинка = Новый Картинка(ДвоичныеДанныеКартинки);
	
	Возврат "photo" + ОбщегоНазначенияСУКлиентСервер.РасширениеКартинки(Картинка.Формат())
	
КонецФункции

Функция ИмяФайлаАватара() Экспорт
	
	Возврат "avatar.png";
	
КонецФункции

#КонецЕсли
